{
    "Experience": [
      {
		  "Employer": "AppsFactory", 
		  "Position": "Software Developer",
		  "Date": "March 2022 - Present",
		  "Responsibilities": [
			  "•  Develop and maintain robust applications to support AppsFactory clients",
			  "•  Design and implement solutions following industry best practices and coding standards",
			  "•  Collaborate with cross-functional teams to deliver high-quality software products.",
			  "•  Participate in code reviews and provide valuable feedback to improve code quality.",
			  "•  Key projects: Volkswagen Inventory Management System, Rewe Salatbar application.",
			  "•  Utilize C#, .NET, .NET CORE, MSSQL MongoDB, Oracle SQL, Azure, Pulumi, Elastic search & Kibana, GIT to develop scalable and efficient solutions."
		  ]
	    },
      {
		  "Employer": "Bank of Industry Nigeria", 
		  "Position": "Software Developer",
		  "Date": "October 2021 - March 2022",
		  "Responsibilities": [
			  "•  Collaborated with a team to develop and enhance software applications supporting the bank's operations.",
			  "•  Gathered requirements from stakeholders and proposed technical solutions using C# and .NET technologies.",
			  "•  Utilized .NET Framework and .NET Core to build reliable and secure applications",
			  "•  Implemented RESTful APIs and integrated with external systems for seamless data exchange. ",
			  "•  Conducted thorough unit testing and resolved bugs to ensure application stability",
			  "•  Key project: BOI's Loan Portal / Internet Banking.",
			  "•  Skills Used - C#, .NET, .NET CORE, MSSQL, Oracle SQL, Azure, Elastic search & Kibana, GIT."
		  ]
	    },
	    {
		  "Employer": "Allianz Nigeria Insurance Limited", 
		  "Position": "Software Developer",
		  "Date": "April 23, 2021 - September 2021",
		  "Responsibilities": [
			  "•  Design and develop applications to support Allianz operations.",
			  "•  Implement programs according to installations standards, procedures and convections",
			  "•  Support continuous improvement by investigating alternatives and technologies for architectural review",
			  "•  Carry out Unit, Functional, integration and load testing of new and upgrade to existing applications.",
			  "•  Updating, repairing, modifying and developing existing software and generic applications.",
			  "•  Prepare and produce releases of software components.",
			  "•  Timely monthly backup and restore of all applications managed.",
			  "•  Second level support for all Allianz solutions.",
			  "•  Carrying out all Financial integrations for Allianz Nigeria.",
			  "•  Skills Used - C#, .NET, .NET CORE, MSSQL, Oracle SQL, Elastic search & Kibana, GIT"
		  ]
	    },
      {
      	"Employer": "Guaranty Trust Bank Plc", 
		"Position": "Software Developer",
		"Date": "2017 - April 23, 2021",
    	"Responsibilities": [
    		"•  Design and develop applications to support bank operations.",
    		"•  Implement and support technology solutions to meet customer’s and business needs.",
			"•  Reviewed and updated GTBanks Tech academy syllabus",
			"•  Provide user training and awareness for all applications managed.",
			"•  Process Automation of User Request for Solutions.",
			"•  Design of new processes and modifications on all workflow applications.",
			"•  Carry out Unit, Functional, integration and load testing of new and upgrade to existing applications.",
			"•  Continuous improvement on in-house applications to reduce errors and increase Performance.",
			"•  Timely monthly backup and restore of all applications managed.",
			"•  Core Applications: GTBank Automated Payment System (GAPS) and QuickCredit.",
			"•  Skills Used – C#, .NET, .NET CORE, MSSQL, Oracle SQL, Typescript, Angular, GIT, Azure, Dapper"
    	]
      },
      {
      	"Employer": "NYSC, Nigerian Naval Engineering College", 
		"Position": "Instructor",
		"Date": "2016 - 2017",
    	"Responsibilities": [
    		"•  Instructor in both the computer engineering school and basic school.",
    		"•  Troubleshooting and repairs of faulty systems within the college. "

    	]
      },
      {
      	"Employer": "Channels Television, Lagos Nigeria", 
		"Position": "Intern",
		"Date": "2014 - 2015",
    	"Responsibilities": [
    		"•  Maintenance and use of the company’s website",
    		"•  Worked with a team of professionals and was entailed in their activities which they perform. "

    	]
      }
	],
	"Education": [
		{
		  "Course": "Masters in Oil and Gas Management", 
		  "School": "South America University",
		  "Date": "2016 - 2017",
		  "Country": "Delaware (USA)"
		},
		{
		  "Course": "Electronics and Computer Engineering (Second Class Upper)", 
		  "School": "Lagos State University ",
		  "Date": "2011 - 2015",
		  "Country": "Nigeria"
		},
		{
		  "Course": "Diploma in Electronics and Computer Engineering", 
		  "School": "Lagos State University",
		  "Date": "2010-2011",
		  "Country": "Nigeria"
		}
	  ]
 }
